In [1]:
import pandas as pd
%matplotlib inline
Train=pd.read_csv('Workshop/train.csv')
Test=pd.read_csv('Workshop/Test.csv')

In [2]:
Train.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [3]:
Test.head()

,Loan_ID,Gender,Married,Dependents,Education,Property_Area,Age,ApplicationID,Loan_Amount,Name,Datetime,Loan_Status
0,LP001002,Female,No,0,Graduate,Urban,39,14110-AED,25000,Mr.Abraham,2013-02-21 06:35:45.658505,Y
1,LP001003,Male,Yes,1,Graduate,Semiurban,50,12117-DEF,50000,Mrs.Kayal,2013-02-21 06:35:45.659381,N
2,LP001005,NaN,NaN,NaN,NaN,NaN,38,GHI-13415,60000,Mr.Lincoln,2013-02-21 11:35:45.659396,Y
3,LP001006,Female,Yes,0,Not Graduate,Rural,43,TQR-14561,NaN,Mrs.MSR,2013-02-21 11:35:45.659396,Y
4,LP001008,Male,No,0,Graduate,Semiurban,29,EFG-13211,80000,Mr.Vinay,2013-02-21 06:35:45.658505,Y

In [4]:
# Create a dataset after dropping rows with more than 4 NA values
temp = Test.dropna(axis=0, how='any', thresh=Test.shape[1] - 4)
temp.head()

,Loan_ID,Gender,Married,Dependents,Education,Property_Area,Age,ApplicationID,Loan_Amount,Name,Datetime,Loan_Status
0,LP001002,Female,No,0,Graduate,Urban,39,14110-AED,25000,Mr.Abraham,2013-02-21 06:35:45.658505,Y
1,LP001003,Male,Yes,1,Graduate,Semiurban,50,12117-DEF,50000,Mrs.Kayal,2013-02-21 06:35:45.659381,N
3,LP001006,Female,Yes,0,Not Graduate,Rural,43,TQR-14561,NaN,Mrs.MSR,2013-02-21 11:35:45.659396,Y
4,LP001008,Male,No,0,Graduate,Semiurban,29,EFG-13211,80000,Mr.Vinay,2013-02-21 06:35:45.658505,Y

In [5]:
# Change name of Urban and semiurban to city and Rural to Village
turn_dict = {'Urban': 'City', 'Semiurban': 'City', 'Rural': 'Village'}
Test.loc[:, 'Property_Area'] = Test.Property_Area.replace(turn_dict)

In [6]:
Test['Property_Area'].value_counts()

City       3
Village    1
dtype: int64

In [7]:
# Percentage of males who are Married
(Test.loc[(Test.Gender == 'Male') & (Test.Married == 'Yes')].shape[0] / float(Test.shape[0]))*100

20.0

In [8]:
# Columns that are available in test but not in train dataset
set(Test.columns).difference(set(Train.columns))

{'ApplicationID',
 'Datetime',
 'Dependents',
 'Gender',
 'Loan_Amount',
 'Loan_ID',
 'Loan_Status',
 'Married',
 'Name',
 'Property_Area'}

In [9]:
# If there are unique values in Age between Train and Test Dataset
set(Test.Age.unique()).issubset(set(Train.Age.unique()))

True

In [10]:
# Split the first string from application ID
Test['ApplicationID'].str.split('-').str[-1]

0      AED
1      DEF
2    13415
3    14561
4    13211
dtype: object

In [11]:
# Fill NA values in Loan Amount with average values of Loan Amount for corresponding gender
Test['Loan_Amount'] = Test.groupby('Gender').transform(lambda x: x.fillna(x.mean())).Loan_Amount
Test.head()

,Loan_ID,Gender,Married,Dependents,Education,Property_Area,Age,ApplicationID,Loan_Amount,Name,Datetime,Loan_Status
0,LP001002,Female,No,0,Graduate,City,39,14110-AED,25000,Mr.Abraham,2013-02-21 06:35:45.658505,Y
1,LP001003,Male,Yes,1,Graduate,City,50,12117-DEF,50000,Mrs.Kayal,2013-02-21 06:35:45.659381,N
2,LP001005,NaN,NaN,NaN,NaN,NaN,38,GHI-13415,60000,Mr.Lincoln,2013-02-21 11:35:45.659396,Y
3,LP001006,Female,Yes,0,Not Graduate,Village,43,TQR-14561,25000,Mrs.MSR,2013-02-21 11:35:45.659396,Y
4,LP001008,Male,No,0,Graduate,City,29,EFG-13211,80000,Mr.Vinay,2013-02-21 06:35:45.658505,Y

In [12]:
#Number of columns with Loan status Y and gender Male
Test.loc[(Test.Loan_Status == 'Y') & (Test.Gender == 'Male')].shape[0]

1

In [13]:
# Number of values with Mr in Name
(Test['Name'].str.find('Mrs.')>0).sum()

0

In [14]:
Test.dtypes

Loan_ID           object
Gender            object
Married           object
Dependents       float64
Education         object
Property_Area     object
Age                int64
ApplicationID     object
Loan_Amount      float64
Name              object
Datetime          object
Loan_Status       object
dtype: object

In [15]:
#convert datatype to category
Test['Dependents'] = Test['Dependents'].astype('category')

In [16]:
Test.dtypes

Loan_ID            object
Gender             object
Married            object
Dependents       category
Education          object
Property_Area      object
Age                 int64
ApplicationID      object
Loan_Amount       float64
Name               object
Datetime           object
Loan_Status        object
dtype: object

In [17]:
#Gender starting with Capital M
Test.Gender.str.startswith('M')

0    False
1     True
2      NaN
3    False
4     True
Name: Gender, dtype: object

In [18]:
# Relationship percentage 
Train['Relationship_Percentage'] = Train.Relationship.map(Train.Relationship.value_counts()/Train.shape[0])

In [19]:
Train.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group,Relationship_Percentage
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K,0.255060
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K,0.405178
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K,0.255060
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K,0.405178
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K,0.048156

In [20]:
Test['Date_time']=pd.to_datetime(Test['Datetime'],unit='s')

In [21]:
Test.head()

,Loan_ID,Gender,Married,Dependents,Education,Property_Area,Age,ApplicationID,Loan_Amount,Name,Datetime,Loan_Status,Date_time
0,LP001002,Female,No,0,Graduate,City,39,14110-AED,25000,Mr.Abraham,2013-02-21 06:35:45.658505,Y,2013-02-21 06:35:45.658505
1,LP001003,Male,Yes,1,Graduate,City,50,12117-DEF,50000,Mrs.Kayal,2013-02-21 06:35:45.659381,N,2013-02-21 06:35:45.659381
2,LP001005,NaN,NaN,NaN,NaN,NaN,38,GHI-13415,60000,Mr.Lincoln,2013-02-21 11:35:45.659396,Y,2013-02-21 11:35:45.659396
3,LP001006,Female,Yes,0,Not Graduate,Village,43,TQR-14561,25000,Mrs.MSR,2013-02-21 11:35:45.659396,Y,2013-02-21 11:35:45.659396
4,LP001008,Male,No,0,Graduate,City,29,EFG-13211,80000,Mr.Vinay,2013-02-21 06:35:45.658505,Y,2013-02-21 06:35:45.658505

In [22]:
Test.dtypes

Loan_ID                  object
Gender                   object
Married                  object
Dependents             category
Education                object
Property_Area            object
Age                       int64
ApplicationID            object
Loan_Amount             float64
Name                     object
Datetime                 object
Loan_Status              object
Date_time        datetime64[ns]
dtype: object

In [23]:
#Difference between the date available and today's date
Test['Days']=pd.datetime.now() - Test.Date_time

In [24]:
Test.head()

,Loan_ID,Gender,Married,Dependents,Education,Property_Area,Age,ApplicationID,Loan_Amount,Name,Datetime,Loan_Status,Date_time,Days
0,LP001002,Female,No,0,Graduate,City,39,14110-AED,25000,Mr.Abraham,2013-02-21 06:35:45.658505,Y,2013-02-21 06:35:45.658505,1328 days 07:47:50.994493
1,LP001003,Male,Yes,1,Graduate,City,50,12117-DEF,50000,Mrs.Kayal,2013-02-21 06:35:45.659381,N,2013-02-21 06:35:45.659381,1328 days 07:47:50.993617
2,LP001005,NaN,NaN,NaN,NaN,NaN,38,GHI-13415,60000,Mr.Lincoln,2013-02-21 11:35:45.659396,Y,2013-02-21 11:35:45.659396,1328 days 02:47:50.993602
3,LP001006,Female,Yes,0,Not Graduate,Village,43,TQR-14561,25000,Mrs.MSR,2013-02-21 11:35:45.659396,Y,2013-02-21 11:35:45.659396,1328 days 02:47:50.993602
4,LP001008,Male,No,0,Graduate,City,29,EFG-13211,80000,Mr.Vinay,2013-02-21 06:35:45.658505,Y,2013-02-21 06:35:45.658505,1328 days 07:47:50.994493

In [25]:
# Find email in the string
import re
string = "his email address is mailto:tom_42@gmail.com please mail him the documents"
match=re.findall(r"[\w._]+@[\w.]+",string)
print match

['tom_42@gmail.com']

In [26]:
# Group data by Gender where Income <=50K
Train.groupby(['Income.Group','Sex']).size().loc['<=50K']

Sex
Female     9592
Male      15128
dtype: int64